
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОситаткиМатериалов.Записывать = Истина ;
	Движения.СтоимостьМатериалов.Записывать = Истина ;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		// Регистр ОситаткиМатериалов Приход
		Движение = Движения.ОситаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаМатериалы.Материал;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаМатериалы.Количество;
		// Регистр Стоимость Материалов Приход
		Движение = Движения.СтоимостьМатериалов.Добавить( );
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаМатериалы.Материал;
		Движение.Стоимость = ТекСтрокаМатериалы.Сумма;
	КонецЦикла ;
КонецПроцедуры
