
Процедура ОбработкаПроведения(Отказ, Режим) 
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
	// Данный фрагмент построен конструктором. 
	// При повторном использовании конструктора внесенные вручную изменения будут утеряны!!! 
	// регистр ОстаткиМатериалов Расход 
	Движения.ОситаткиМатериалов.Записывать = Истина ; 
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл 
		Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНомеклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда 
			Движение = Движения.ОситаткиМатериалов.Добавить(); 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Движение.Период = Дата; 
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура; 
			Движение.Склад = Склад; 
			Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество; 
		КонецЕсли ; 
	КонецЦикла ; 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
КонецПроцедуры
